# SSH and Security
- speacher: pro. Chen
- date: 2025-7-28
- class 9
- cisco chapter 16 network securtiy
- cisco chapter 17 
- cisco CCNA2 chapter 2 switch router and wifi
#packettracer #ssh #security #shutdown #disable_unused #domain-lookup #administratively_down #實務
#CCNA2 #POST

## security
```console
RTR-A(config)#security passwords min-length 10
RTR-A(config)#line console 0
RTR-A(config-line)#password @Cons1234!
RTR-A(config-line)#login
RTR-A(config-line)#exec-timeout 7
RTR-A(config-line)#line vty 0 4
RTR-A(config-line)#password @Cons1234!
RTR-A(config-line)#login
RTR-A(config-line)#exec-timeout 7
RTR-A(config-line)#exit
RTR-A(config)#enable secret @Cons1234!
RTR-A(config)#banner motd #Restrict Access Only#
RTR-A(config)#service password-encryption 
RTR-A(config)#username NETadmin secret LogAdmin!9
```
## SSH required 
1. 必須產生金鑰 
2. 必須有使用者/密碼
3. 限定登入
```console
RTR-A(config)#username NETadmin secret LogAdmin!9
RTR-A(config)#ip domain-name security.com
RTR-A(config)#crypto key generate rsa
How many bits in the modulus [512]: 1024
RTR-A(config)#line vty 0 4
RTR-A(config-line)#transport input ssh
RTR-A(config)#login block-for 45 attempts 3 within 100
```
```console
SW-1(config)#ip domain-name security.com
SW-1(config)#crypto key generate rsa
How many bits in the modulus [512]: 1024
SW-1(config)#username NETadmin secret LogAdmin!9
SW-1(config)#line vty 0 15
SW-1(config-line)#transport input ssh
SW-1(config-line)#login local
```

### tips
```
line console 0
console ports 0-15

line vty 0 4
vty ports 0-4
```
## switch
### interface status 



### orders history
```console
CCNA1-ITN-16.5.1

RTR-A

Router>enable 
Router#configure terminal 
Router(config)#no ip domain-lookup 
Router(config)#hostname RTR-A
RTR-A(config)#security passwords min-length 10
RTR-A(config)#line console 0
RTR-A(config-line)#password @Cons1234!
RTR-A(config-line)#login
RTR-A(config-line)#exec-timeout 7
RTR-A(config-line)#line vty 0 4
RTR-A(config-line)#password @Cons1234!
RTR-A(config-line)#login
RTR-A(config-line)#exec-timeout 7
RTR-A(config-line)#exit
RTR-A(config)#enable secret @Cons1234!
RTR-A(config)#banner motd #Restrict Access Only#
RTR-A(config)#service password-encryption 
RTR-A(config)#username NETadmin secret LogAdmin!9
RTR-A(config)#ip domain-name security.com
RTR-A(config)#crypto key generate rsa
How many bits in the modulus [512]: 1024
RTR-A(config)#line vty 0 4
RTR-A(config-line)#transport input ssh
RTR-A(config)#login block-for 45 attempts 3 within 100

 

SW-1

Switch>enable 
Switch#show ip interface brief
Switch#configure terminal 
Switch(config)#interface range f0/1,f0/3-9,f0/11-24,g0/2
Switch(config-if-range)#shutdown 
Switch(config-if-range)#exit
Switch(config)#interface vlan 1
Switch(config-if)#ip address 192.168.1.254 255.255.255.0
Switch(config-if)#no shutdown 
Switch(config-if)#exit
Switch(config)#enable secret @Cons1234!
Switch(config)#hostname SW-1
SW-1(config)#ip domain-name security.com
SW-1(config)#crypto key generate rsa
How many bits in the modulus [512]: 1024
SW-1(config)#username NETadmin secret LogAdmin!9
SW-1(config)#line vty 0 15
SW-1(config-line)#transport input ssh
SW-1(config-line)#login local
SW-1(config-line)#exit
SW-1(config)#ip default-gateway 192.168.1.1
```



#### 實務
1. 戶外事件，落雷感電燒壞switch
2. 廠商保固，HP有限終身保固，偏好國際品牌
3. 台灣設備，有時候重開就好了
4. 備援設備，無縫接軌中斷的服務
5. 設備生命週期，8-10年


## 小型網路成長實務
- **網路文件** 非常重要，實體與邏輯拓樸 
- **裝置清單** 網路架構的設備
- **預算** 紀錄IT預算
- **流量分析** wireshark 或更高級

### 員工網路使用率
照片快照，記錄各種設備狀態
- 用遠記得要留使用紀錄，才能有比較基準

## 網路正常
1. 內部設備
2. base line，ping內網(回應標準<`10ms`)
3. 

### Show cisco discovery protocol (CDP)
- Cisco 設備專用協定
- Layer 2 protocol
- 可知道設備硬體資料、韌體版本
- 關閉服務， (config)# no cdp
- 關閉介面， (config-line)# no enable cdp


####
Tx 傳送
Rx 接收
兩個介面都需要支援gigabitsEthernet才會是 1G網速



## packet tracer
c. 使用以下 show 指令回答第 2 部分中的Reflection 問題。

注意：如果指令在 -—More— 提示下暫停，請務必按空格鍵，直到 ISPRouter# 提示出現以取得所有指令輸出。

show arp

show flash:

show ip route

show interfaces

show ip interface brief

show protocols

show users

show version

關閉設定視窗。

Part 2:Reflection Questions
1. 您可以使用 哪些命令來確定接口的 IP 地址和網絡 前綴？

2. 哪個命令提供 IP 位址和介面指派，但不 提供網路前置詞？

3.     您將使用哪些命令來確定接口是否啟動？

4.     您需要確定路由器上運行的IOS版本。哪個 命令會給你這些信息？

5. 哪些命令提供路由器 介面位址的相關資訊？

6. 您正在考慮 IOS 升級，需要確定是否路由器閃光燈 可以持有新的 IOS。哪些命令會提供可用 快閃記憶體容量的相關資訊？

7. 您必須調整路由器設定，但您懷疑 同事可能也會從另一個位置使用路由器。哪個 命令提供用於配 置或裝置監控的行的相關資訊？

8.     您被要求檢查設備接口的性能。 Which command provides traffic statistics for router interfaces?

9. 客戶抱怨無法連接到他們用 於檔案儲存的伺服器。您懷疑網路可能因為最近的升級而 無法連線。哪個命令提供有關網路流量可 用路徑的資訊？

10. ISP 路由器上目前有哪些 介面處於作用中狀態？


## 實務
紀錄問題與措施
- cisco 故障回報只會傳送給設備，所以下指令`terminal monitor`，來取得設備debug資訊
- IPv4在同一張網卡只能有一個IPv4，- 但ipv6可以在同一張網卡有多個IPv6

## packet tracer 1.17.8
```
as predict 
192.168.0.0/24
it 25 => 32
1110000.224

sale 50 => 64
11000000.192

staff 100 => 128
10000000.128

guest 25 => 32
11100000.192

staff 0-127 
g0/0 .128

sale 128-191
g0/1 .192

IT 192-223
g0/2 .224

guest 224-255
g0/3 .224
```




## CCNA2 boost Switch
boot 
1. ROM : read-only detect hardware device
2. OS

signal LED
syst 系統
spd  
PoE  網路線供電

### collision
late collision
1. cable too long (recommend 100m)
2. trans by many device (recommend 7 switch below)
3. 電器干擾


### interface setting
duplex雙工、speed速度、MDIX跳線通訊

### packet tracer
```console
CCNA2-SRWE-1.3.6

S1

PC1>telnet 10.10.10.2
密碼：cisco
s1>enable
密碼：cisco
S1#show running-config
可以看到密碼
S1#configure terminal 
S1(config)#service password-encryption 
S1(config)#exit
S1#show running-config
密碼都已加密變成亂碼
S1#configure terminal 
S1(config)#ip domain-name netacad.pka
S1(config)#crypto key generate rsa
How many bits in the modulus [512]: 1024
S1(config)#username administrator se
S1(config)#username administrator secret cisco
S1(config)#line vty 0 15
S1(config-line)#transport input ssh
S1(config-line)#login local
S1(config-line)#no password 
S1(config-line)#exit
S1(config)#end
S1#show ip ssh
SSH Enabled - version 1.99
S1#copy running-config startup-config


```

# gemini
Let's break down the meaning of `login local` in the context of your Cisco switch configuration.

-----

## What `login local` Means

When you configure `login local` on a Cisco device's VTY (Virtual Teletype) lines (which are used for remote access like SSH or Telnet), you're telling the device to use its **local database** for authenticating users.

Here's a more detailed explanation:

  * **Local Database:** This refers to the usernames and passwords that you've configured directly on the switch itself using commands like `username [username] privilege [level] secret [password]`.
  * **Authentication Method:** Instead of relying on an external server (like a RADIUS or TACACS+ server) for authentication, the switch will check the credentials against the list it has stored internally.

-----

## Why `login local` is Used Here

In your configuration snippet:

```
S1(config)#line vty 0 15
S1(config-line)#transport input ssh
S1(config-line)#login local
S1(config-line)#no password 
S1(config-line)#exit
```

1.  **`line vty 0 15`**: This command selects the virtual terminal lines, which are used for remote access. `0 15` means you're applying these settings to VTY lines 0 through 15, allowing up to 16 simultaneous remote connections.
2.  **`transport input ssh`**: This specifies that only SSH (Secure Shell) connections are allowed on these VTY lines. SSH encrypts the connection, making it much more secure than Telnet.
3.  **`login local`**: This is the key command. It tells the switch, "When someone tries to log in via SSH on these lines, check their username and password against the usernames and passwords configured directly on *this* switch."
4.  **`no password`**: This command, when used on VTY lines along with `login local`, specifically indicates that the *line password* should not be used. Instead, authentication will solely rely on the locally configured usernames and passwords. If you were *not* using `login local`, this command would typically be followed by `password [your_password]`, meaning all users connecting to that line would use the same password. With `login local`, individual user accounts are used instead.

-----

## In Summary

`login local` is a fundamental command for enabling secure remote access to your Cisco device by leveraging its internal user database. It ensures that only authorized users with accounts configured directly on the switch can log in, especially when combined with secure protocols like SSH.

Do you have any other parts of this configuration you'd like to understand?



