# Inter-VLAN Routing using Layer 3 Switches
- speacher: pro. Chen
- date: 2025-8-15
- class 12
- CCNA2 chapter 4.3 Inter-VLAN Routing using Layer 3 Switches
- chapter 5 STP 
- chapter 6 route and wifi

#vlan #ip_routing #ipv6_unicast-routing #OSPF #trunk #trunk_encapsulation_dot1q #Native_vlan #route #subinterface #encapsulation_dot1Q_VID_Native #show_spanning_tree #STP #rootport #channel-group #LACP #MSTP #port-channel #

## 實務
- 第三層交換器，單一網路環境(乙太網路)可以用加速器運作，比傳統路由器運作更快速。
    - 10G/20port 交換計當主幹
- 路由器可以做訊框格式轉換，可以接通各種網路。
- 管理用vlan設定，資安考量
- vlan ID 與 IP 有相關性較好管理.


## 4.3 inter-vlan routing
啟動第三層路由
>D1(config)# ip routing


更啟動IPv6一樣需要啟動
D1(config)# ipv6 unicast-routing

Vlan 刪除 屬於該vlan 的port將不屬於任何port
不屬於任何vlan的port 在新增vlan時自動掛上

### switch ip interface

`no switchport` change to a route port, and auto up

```console
D1(config)# interface GigabitEthernet0/0/1
D1(config-if)# description routed Port Link to R1
D1(config-if)# no switchport
D1(config-if)# ip address 10.10.10.2 255.255.255.0
D1(config-if)# no shut
D1(config-if)# exit
D1(config)#
啟動路由服務
D1(config)# ip routing
D1(config)#
```

### OSPF
3. Configure routing.
Configure the OSPF routing protocol to advertise the VLAN 10 and VLAN 20 networks, along with the network that is connected to R1. Notice the message informing you that an adjacency has been established with R1.

```console
D1(config)# router ospf 10
D1(config-router)# network 192.168.10.0 0.0.0.255 area 0
D1(config-router)# network 192.168.20.0 0.0.0.255 area 0
D1(config-router)# network 10.10.10.0 0.0.0.3 area 0
D1(config-router)# ^Z
D1#
*Sep 17 13:52:51.163: %OSPF-5-ADJCHG: Process 10, Nbr 10.20.20.1 on GigabitEthernet0/0/1 from LOADING to FULL, Loading Done
D1#
使用萬用遮罩 mask 做反相

> show ip route | begin Gateway
O 10.20.20.0/24 [110/2] 
從其他OSPF學習
```
### by gemini
總結
所以，要判斷是否需要設定，最簡單的方法是：

如果你的設備較舊，或者你在使用「Router-on-a-stick」架構，你需要手動設定 switchport trunk encapsulation dot1q。

如果你的設備是近年來購買的主流型號，通常已經不需要這個指令，直接設定 switchport mode trunk 即可。


### 4.4.8 fixed setting
```console
1.PC3預設閘道錯誤

2.S1 G0/1介面設定錯誤
S1>enable 
S1#show running-config 
S1#configure terminal 
S1(config)#interface G0/1
S1(config-if)#switchport mode trunk 

3.R1子介面封裝的vlan設定錯誤
R1>enable 
R1#show running-config 
R1#configure terminal 
R1(config)#interface g0/1.10
R1(config-subif)#no encapsulation dot1Q
R1(config-subif)#interface g0/1.30
R1(config-subif)#encapsulation dot1Q 30
R1(config-subif)#interface g0/1.10
R1(config-subif)#encapsulation dot1Q 10
R1(config-subif)#no shutdown 
```

## 5 STP 
定期發送訊息避免迴圈
- cisco protocol: CDP
- 交換器 BPDU 
- 路由器 動態路由

STP: spanning tree protocol
- 802.1D協定
- 備援機制讓網路形成迴圈


### 網路設備名詞
**支援** : 不一定能使用，可能要額外購買。
**提供** : 一定能啟用。


###
```console
S1# show spanning tree
 Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0001.6448.C6E7
             Cost        4
             Port        26(GigabitEthernet0/2)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     000B.BE31.D3DA
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20
Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Gi0/2            Root FWD 4         128.26   P2p
Gi0/1            Desg FWD 4         128.25   P2p
Fa0/1            Desg FWD 19        128.1    P2p


Hello Time 每兩秒一次訊息, 20秒沒回應視為斷線
g0/2 往根橋接器

ROLE: root 往根橋接器, ALT 迴圈封鎖, Desg 其他裝置

```


802.1w
修改了SPD COST參考
越小越快

## 5.2.8 多個相同成本路徑選取根連接埠
選擇最少成本
1. Lowest sender BID
2. Lowest sender port priority
3. Lowest sender port ID

STP 計時器
- **Hello Time** : BPDU間隔2秒
- **Forward Delay Timer** : 偵聽和學習的話費時間，預設15秒
- **MaX Age Time** : 最大保留拓樸

|狀態|時間|BPDU|
|:-|:-|:-|
| 封鎖 | 20S | 只接收 |
| 偵聽 | 15S | 接送 |
| 學習 | 15S | 接送 |

正常埠等50秒開通

STP版本
1. PVST+    每個Vlan提供個別spanning tree
2. RSTP     快速STP
3. MSTP     IEEE制定多顆生成樹, 最多16個

STP  : 停用, 偵聽, 學習, 轉送. 需要50s
RSTP : 捨棄, 學習, 轉送. 需要35s

FastPort, BDPU guard設定, 前者接設備不用BDPU, 後者封鎖BDPU

## 6 鏈路聚合
- 實體分離、邏輯共用
- 乙太通道, 共用虛擬網路, 提供更大頻寬, 提升可靠性(備援)
- 介面統一, FastEthernet與GigabitEthernet不能混用
- 最多8個相同

### 6.1.5 自動協定
- PAgP 鏈路聚合協定
- LACP 鏈路聚合控制協定

PAgP 思科專利, 自動建立乙太通道, 相同速度, 雙工設定, vlan設定
- ON: 不協商,兩端都ON
- PAgP desirable : 自動判斷
- PAgP auto : 另一端需要desirable, 被動協商, 兩端auto 被動不建立連線

LACP 802.3ad
- ON : 兩端都要ON
- LACP active : 自動判斷
- LACP passive : 另一端需要active


### 6.2.4 LACP sample  
```
S1(config)# interface range FastEthernet 0/1 - 2
S1(config-if-range)# channel-group 1 mode active
Creating a port-channel interface Port-channel 1
S1(config-if-range)# exit
S1(config)# interface port-channel 1
S1(config-if)# switchport mode trunk
S1(config-if)# switchport trunk allowed vlan 1,2,20
S1(config-if)# no shutdown

調整樹節點權重
S1(config)# spanning-tree vlan 1 root primary
或成為根交換器
S1(config)# spanning-tree vlan 1 priority 24576

S1#show etherchannel summary
S1#show spanning-tree active
```


### 6.3.2 常見問題 
show etherchannel summary
show running-config

先停用再新增規則
interface range g0/1-2
no channel-group
channel-group 1 mode active


實體都設置為中繼連接(trunk)port-channel自動更新
interface port-channel 1
trunk