# DHCP
- speacher: pro. Chen
- date: 2025-8-22
- class 13
- CCNA2 chapter 7 DHCP
- CCNA2 chapter 8 SLAAC, DHCPv6
- CCNA2 chapter 9 預設閘道限制
- CCNA2 chapter 10  LAN Security Concepts
- CCNA2 chapter 11 保護(CCNA必考)

#DHCP #ip_dhcp #DHCP_attack #啟動DHCP #中繼DHCP #SLAAC #DHCPv6 #default-gateway #Layer2_Attact #CCNA2 #show_port-security #show_port-security_address
## 實務
- 防火牆在最外層，常常與DHCP服務綁在一起。
- 基本上會有兩台DHCP服務器
- DNS實務上也會架設兩台
- ip常保留最後15個 240-254 (255廣播IP),提供路由器交換器印表機等附屬設備使用
- 思科指令只有小寫，所以用大寫來辨識修自訂一名稱
- 路由器預設開啟DHCP
- 拿到設備第一個檢查所有服務，並關閉不必要的服務，提升資源使用
- DHCP前有交換器會先做STP生成樹需要正常50秒啟動(RSTP20秒)後才拿到IP
- IPV6 無狀態SLAAC最常使用
- 路由IPv6優先於IPv4
- 備援路由兩台分別對兩家外網

## DHCP
運作模式
1. PC : boardcast DHCPDIScover, 要IP
2. Server: singlecast DHCPoffer, 給IP
3. PC : boardcast DHCPrequest, 收到了IP
4. Server: singlecast DHCPpack, 確認

- PC向server租用IP直到不續約
- server每隔租用期間的一半會詢問是否續約，4小時問不到、2小時問不到...自動過期

**路由器設定**
```
router(config)# ip dhcp excluded-address low-address [high-address]
```

思科指令只有小寫，所以用大寫來辨識修改過的名稱

**一般指令**
```
network `network-number` [mask | /prifix-lenght]
default-route `address` [address2...address8]

服務DNS
dns-server `address` [address2...address8
]

網域名稱
domain-name `domain`

定義租用時間
lease {days [hours [minuts]] | infinite}
infinite無限租用,發放給固定人員
```


**驗證**
```
show running-config | section dhcp
show ip dhcp binding
show ip dhcp server statistics
```
DHCP attack
注意DHCP攻擊，假冒MAC要IP 8小時


### 指令 sample 
1. 訂定IP池
```console
先排除固定使用IP
R1(config)#ip dhcp excluded-address 192.168.11.1 192.168.11.9
R1(config)#ip dhcp excluded-address 192.168.11.254

設定IP池
R1(config)#ip dhcp pool LAN-POOL-2
R1(dhcp-config)#network 192.168.11.0 255.255.255.0
R1(dhcp-config)#default-router 192.168.11.1
R1(dhcp-config)#dns-server 192.168.11.6
R1(dhcp-config)#domain-name example.com
R1(dhcp-config)#end
```

2. 啟用關閉服務
```
R1(config)# no service dhcp
R1(config)# service dhcp
R1(config)#
```

3. 路由器中繼DHCP
```
中繼router R2
R2(config)# interface g0/1
R2(config-if)# ip address dhcp
R2(config-if)# no shutdown

中繼router後面的router R1
IP helper指定到對接port而非DNS可以減少路由表轉換，效能最好
R1(config)# interface g0/0/0
R1(config-if)# ip helper-address 192.168.11.6
```

4. 驗證DHCP
```
步驟 1：驗證 DHCP 繫結。
R2# show ip dhcp binding
show ip interface brief
```

### 7.2.9 Other Service Broadcasts Relayed
DHCPv4 is not the only service that the router can be configured to relay. By default, the ip helper-address command forwards the following eight UDP services:

Port 37: **Time**
Port 49: TACACS
Port 53: **DNS**
Port 67: DHCP/BOOTP server
Port 68: DHCP/BOOTP client
Port 69: TFTP
Port 137: NetBIOS name service
Port 138: NetBIOS datagram service

## 8 IPv6 GUA
1. SLAAC
2. 無DHCP SLAAC(最常使用)，不管理IP發送紀錄，全自動
3. DHCPv6，管理IP發送紀錄

## SLAAC
RA訊息
A旗標: 只送IPv6
O旗標: 其他資訊
M旗標: 管理

| method | RA |
|:-|:-|
| 僅SLAAC | RA(A=1, O=0, M=0)
| 無狀態DHCP-SLAAC | RA(A=1, O=1, M=0)
| 有狀態DHCPv6 | RA(A=0, M=1)


## 8.2.6 重複位址偵測
ff02::1 所有設備群波
ff02::2 所有路由
DAD : duplicate address detect

### 路由啟用
1. 無狀帶 DHCPv6
R1(config-if)# ipv6 nd other-config-flag
2. 有狀態 DHCPv6
R1(cfg-if)# ipv6 nd managed-config-flag
R1(cfg-if)# ipv6 nd prefix default no-autoconfig
3. IPv6 優先於 IPv4
用戶端 statuless 
ipv6 address autoconfig


### 有狀態DHCP
address prefix IP/64
dns
domain-name 'name'
R1 - DHCP
interface g0/0
ipv6 nd manage-config-flag
ipv6 nd prefix default 

client R3
ipv6 unicast-route
ip address dhcp

### 驗證
R1#
show ipv6 dhcp pool
show ipv6 dhcp binding



## 9.1 路由器備援
**FHRP: first hop redundancy protocols** : 設備連上網路的第一站，路由器，作為網際網路的出入口，無法停止服務所以要建立備援並能隨時上線工作。
1. 只有一個閘道會啟用
2. 設定虛擬路由器，再由實體路由器轉送

FHRP選項
1. HSRP : 熱備援
2. VRRPv3 : 公開協議，支援多家廠商
3. 負載平衡(GLBP) : 思科FHRP
4. ICMP路由器查找

### 9.2.2 HSRP優先等級和搶占
優先級: HSRP 預設100，或IPv4最高
搶佔: 強制通道


**HSRP狀態**
1. 起始
2. 學習
3. 偵聽
4. 說話
5. 待命

活耀/待命，每3秒hello，10秒後取代
限制hello時間1s以上
限制保留時間4s以上

### sample 9.3.4 
Router設定
```
R1(config)#interface g0/1
R1(config-if)#standby version 2
R1(config-if)#standby 1 ip  192.168.1.254
R1(config-if)#standby 1 priority 150
R1(config-if)#standby 1 preempt 
R1(config-if)#end
R1#show standby 
R1#show standby brief
```

## 10  LAN Security Concepts
NG :next generat

NAC裝置:驗證、授權、計量(AAA)
身分控管

新世代防火牆:
- 過濾URL, 阻擋惡意網址
- 過濾port, 阻擋不必要的服務FTP


### 10.2.1
本地密碼認證
password ci5c0

AAA伺服器


### 10.3.2 攻擊
MAC表攻擊
VLAN攻擊
DHCP攻擊
ARP攻擊
位置詐騙攻擊
STP攻擊

### 10.3.3 緩解
連接埠安全
DHCP監聽 
動態ARP監測(DAI)
IP守衛

### 10.5.10 CDP
每30秒傳送，IP, OS version, vlan


## 11 防護
第10章講概念，第11講思科設備設定

### 11.1.3 連接埠安全性


Switch(config)# interface range type *module/first-number* – *last-number*

### 11.1.4 限制和學習MAC
設定switch
**要求ACCESS模式**
```
S1(config)# interface f0/1
S1(config-if)# switchport port-security
Command rejected: FastEthernet0/1 is a dynamic port.
S1(config-if)# switchport mode access
S1(config-if)# switchport port-security
```

**限制最大裝置**
一般來說很少超過10個
```
S1(config)# interface f0/1
S1(config-if)# switchport port-security maximum ?
  <1-8192>  Maximum addresses
S1(config-if)# switchport port-security maximum
```


**動態學習**
```
switchport port-security mac-address sticky
show port-security address
show port-security 
```
### 11.1.6 違規安全模式
都會**捨棄違規流量**, protect不留下紀錄
違規處理，不要每次都shutdown，需要管理員手動重新啟動(shutdown and no shutdown)
```
Switch(config-if)# switchport port-security violation {  protect | restrict |  shutdown}
```
shutdown : (預設模式)關閉port，需要管理員手動啟動
protect : 等待清除多餘MAC後就開起
restrict : 違規紀錄, 等清除MAC表後恢復服務

### 11.1.9 samples
**在介面中設定安全連線埠**
```
interface fa0/5
switchport mode access
啟用安全埠
switchport port-security
設定最大連線數量
switchport port-security maximum 3
靜態設定
switchport port-security mac-address aaa.bbbb.1234
動態學習
switchport port-security mac-address stich
```

**驗證**
```
統計
show port-security
個別介面
show port-security interface fa0/5
列出所有PORT
show port-securtiy address
```




## Gemini
AD and DHCP
總結
**DHCP**：負責分配 IP 和 DNS 伺服器位址。

**Active Directory (AD)**：需要一個 專屬的 DNS 伺服器來解析其內部網域名稱。

路由器上的 DHCP 就像一個引路人，它必須正確地指引網路上的電腦去拜訪你的 AD 伺服器所提供的 DNS 服務。如果你沒有正確設定，電腦就找不到 AD，整個網域服務就會失效。

所以，雖然路由器上的 DHCP "domain name" 選項看起來和 AD 網域名稱很像，但更關鍵的是 DHCP 設定中的 **DNS 伺服器位址**，它必須指向你的 Windows Server，這樣才能確保 AD 能夠正常運作。