# ACL, NAT and others
- speacher: pro. Chen
- date: 2025-10-03
- class 17
- CCNA3 chapter5 ACL延伸
- CCNA3 chapter6 NAT
- CCNA module 補充(會考)

#ACL #ACL延伸 #standardACLs #extentedACLs #access-list #access-class_VTY #NAT

## 實務
ACL原則確認好來源與目的
公司在設定ACL都使用白名單ACL
學校開放式環境使用黑名單ACL
防火牆已經成為政府單位基本設備
OUT-FW防火牆-IPS入侵防禦系統-防毒牆-IN
防毒牆需要更多資源解密，防毒需要部屬到終端
防火牆與入侵防禦系統正在整合
路由器主要是網路協議，防火牆功能還是要獨立設備
企業防火牆設備管理firewall與NAT
小型組織(50人以內)使用路由器簡單使用就可以
防火牆區分=內部、外部與伺服器區域
防火牆也需要備援
防火牆等級看流量 1G, 10G, 100G
路由器ACL當內部port:135,139等高風險服務攻擊
ACL 盡量為自己寫註解
跳槽才能加薪
專案經驗證明
專業證照CCNP CCIE



## ACL-e
標準ACL只管理來源IP
1-99
放靠近目的端

延伸ACL可以設定 {來源/目的},{ports},{IN/OUT}
100-199
放靠近來源端

### 常用的通訊PORT
R1(config)# access-list 100 permit tcp any any eq ? 
```
  <0-65535>    Port number
  bgp          Border Gateway Protocol (179)
  chargen      Character generator (19)
  cmd          Remote commands (rcmd, 514)
  daytime      Daytime (13)
  discard      Discard (9)
  domain       Domain Name System (53) 
  echo         Echo (7)
  exec         Exec (rsh, 512)
  finger       Finger (79)
  ftp          File Transfer Protocol (21) 
  ftp-data     FTP data connections (20) 
  gopher       Gopher (70)
  hostname     NIC hostname server (101)
  ident        Ident Protocol (113)
  irc          Internet Relay Chat (194)
  klogin       Kerberos login (543)
  kshell       Kerberos shell (544)
  login        Login (rlogin, 513)
  lpd          Printer service (515)
  msrpc        MS Remote Procedure Call (135)
  nntp         Network News Transport Protocol (119)
  onep-plain   Onep Cleartext (15001)
  onep-tls     Onep TLS (15002)
  pim-auto-rp  PIM Auto-RP (496)
  pop2         Post Office Protocol v2 (109)
  pop3         Post Office Protocol v3 (110) 
  smtp         Simple Mail Transport Protocol (25) 
  sunrpc       Sun Remote Procedure Call (111)
  syslog       Syslog (514)
  tacacs       TAC Access Control System (49)
  talk         Talk (517)
  telnet       Telnet (23) 
  time         Time (37)
  uucp         Unix-to-Unix Copy Program (540)
  whois        Nicname (43)
  www          World Wide Web (HTTP, 80) 
  ```

  ### sample
  接受來源192.168.10.0/24的 HTTP, HTTPS 流量
  
```
  access-list 110 permit tcp 192.168.10.0 0.0.0.255 any eq www
  access-list 110 permit tcp 192.168.10.0 0.0.0.255 any eq 443
```
 
  **防火牆**

  Established 學習 主動建立的連線，先出後進
```
  access-list 120 permit tcp any 192.168.10.0 0.0.0.255 established
  ip access-group 120 out
```

延伸ACL
(config)# ip access-list extended *access-list-name*

access-list-name = 大寫英文且唯一名稱(Cisco英文大寫是自訂義名稱默契)

deny any 

**流量 進 路由器**

R1(config-if)# ip access-group SURFING in

**流量 出 路由器**

R1(config-if)# ip access-group BROWSING out

### sample 5.4.12 configure extended IPv4 ACLs
兩名員工需要存取伺服器所提供的服務。PC1 只需要 FTP 存取，而 PC2 只需要網路存取。兩台電腦都必須能夠 ping 伺服器，但不能互相 ping。

PC1 at g0/0
```bash
R1(config)# access-list 100 permit tcp 172.22.34.64 0.0.0.31 host 172.22.34.62 eq ftp
R1(config)# access-list 100 permit icmp 172.22.34.64 0.0.0.31 host 172.22.34.62
R1(config)# interface gigabitEthernet 0/0
R1(config-if)# ip access-group 100 in
```

PC2 at g0/1
```bash
R1(config-ext-nacl)# permit tcp 172.22.34.96 0.0.0.15 host 172.22.34.62 eq www
R1(config-ext-nacl)# permit icmp 172.22.34.96 0.0.0.15 host 172.22.34.62
R1(config)# interface gigabitEthernet 0/1
R1(config-if)# ip access-group HTTP_ONLY in

# show access-lists
```

### sample 5.4.13 configure extended IPv4 ACLs 2
```bash
RT1(config-ext-nacl)#deny tcp host 172.31.1.101 host 64.101.255.254 eq 80
RT1(config-ext-nacl)#deny tcp host 172.31.1.101 host 64.101.255.254 eq 443
RT1(config-ext-nacl)#deny tcp host 172.31.1.101 host 64.103.255.254 eq 80
RT1(config-ext-nacl)#deny tcp host 172.31.1.101 host 64.103.255.254 eq 443
RT1(config-ext-nacl)#deny tcp host 172.31.1.102 host 64.101.255.254 eq 21
RT1(config-ext-nacl)#deny tcp host 172.31.1.102 host 64.103.255.254 eq 21
RT1(config-ext-nacl)#deny icmp host 172.31.1.103 host 64.101.255.254 
RT1(config-ext-nacl)#deny icmp host 172.31.1.103 host 64.103.255.254 
RT1(config-ext-nacl)#permit ip any any

do show access-lists
```

### sample 5.5.1 IPv4 ACLs Implementation


```bash
HQ 
HQ(config)#access-list 101 deny tcp any host 192.168.1.70 eq ftp
HQ(config)#access-list 101 deny icmp any 192.168.1.0 0.0.0.63
HQ(config)#access-list 101 permit ip any any
HQ(config)#interface s0/1/0
HQ(config-if)#ip access-group 101 in
HQ(config-if)#exit
原則是封鎖來源盡量靠近目的路由器
但是協定使用延伸ACL所以選靠近來的路由器
HQ(config)#access-list 111 deny ip any host 192.168.2.45
HQ(config)#access-list 111 permit ip any any
HQ(config)#interface g0/0/0
HQ(config-if)#ip access-group 111 in
HQ(config-if)#exit
HQ(config)#ip access-list standard vty_block
HQ(config-std-nacl)#permit 192.168.1.64 0.0.0.7
HQ(config-std-nacl)#exit
針對遠端連線使用acces-class
HQ(config)#line vty 0 4
HQ(config-line)#access-class vty_block in
HQ(config-line)#exit
HQ(config)#ip access-list extended branch_to_hq


Branch
Branch(config)#ip access-list extended branch_to_hq
Branch(config-ext-nacl)#deny ip 192.168.2.0 0.0.0.31 192.168.1.0 0.0.0.63
Branch(config-ext-nacl)#deny ip 192.168.2.32 0.0.0.15 192.168.1.0 0.0.0.63
Branch(config-ext-nacl)#permit ip any any
Branch(config-ext-nacl)#exit
Branch(config)#interface s0/1/1
Branch(config-if)#ip access-group branch_to_hq out


修改
HQ(config)#ip access-list extended 111
HQ(config-ext-nacl)#no 10 
HQ(config-ext-nacl)#10 deny ip any host 192.168.2.45

```


## NAT
解決IPv4不足，提供內外部IP連線

### sample 手動設定NAT
建立靜態 NAT 轉譯，將 Server1 內部位址對應至其外部位址。
```bash
R1(config)# ip nat inside source static 172.16.16.1 64.100.50.1
 
設定 G0/0 介面為內部介面。
R1(config)# interface g0/0
R1(config-if)# ip nat inside

將 s0/0/0 公用介面設定為外部介面。
R1(config)# interface s0/0/0
R1(config-if)# ip nat outside

驗證
show running-config
show ip nat translations
show ip nat statistics
```

### 動態NAT
R2(config)# ip nat pool NAT-POOL1 209.165.200.226 209.165.200.240 netmask 255.255.255.224


CISCO設備預設保留24HR的nat

### sample 6.4.5 Dynamic NAT
```bash
R2(config)#access-list 1 permit 172.16.0.0 0.0.255.255
R2(config)#ip nat pool NAT_POOL 209.165.200.229 209.165.200.230 netmask 255.255.255.252
R2(config)#ip nat inside source list 1 pool NAT_POOL
R2(config)#interface s0/0/0
R2(config-if)#ip nat outside 
R2(config-if)#interface s0/0/1
R2(config-if)#ip nat inside 
R2(config-if)#end

PC1連線Web Server後
R2#show ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
tcp 209.165.200.229:1025172.16.10.1:1025   209.165.201.5:80   209.165.201.5:80

PC1連線Web Server後
R2#show ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
tcp 209.165.200.229:1025172.16.10.1:1025   209.165.201.5:80   209.165.201.5:80
tcp 209.165.200.230:1025172.16.10.2:1025   209.165.201.5:80   209.165.201.5:80

L1連線Web Server後
R2#show ip nat statistics 
```

當連線占

### sample 6.5.6 Dynamic NAT
```bash
R2(config)# ip nat pool NAT-POOL1 209.165.200.226 209.165.200.240 netmask 255.255.255.224

R2(config)# access-list 1 permit 192.168.0.0 0.0.255.255

合併NAT內外規則 ACL+NAT POOL
R2(config-if)# ip nat inside source list 1 pool NAT-POOL1

R2(config)# interface serial 0/1/0
R2(config-if)# ip nat inside

R2(config)# interface serial 0/1/1
R2(config-if)# ip nat outside
```


### PAT 
多對一，多對少
```bash
指定介面
ip nat inside source list 1 inter face s0/0/0 overload
指定POOL
ip nat inside source list 1 pool POOL2 overload
```

### sample 6.6.7
```bash
R1(config)#access-list 1 permit 172.16.0.0 0.0.255.255
設定POOL的範圍
R1(config)#ip nat pool ANY_POOL_NAME 209.165.200.233 209.165.200.234 netmask 255.255.255.252
R1(config)#ip nat inside source list 1 pool ANY_POOL_NAME overload 
介面設定NAT
R1(config)#interface g0/0/0
R1(config-if)#ip nat inside 
R1(config-if)#interface g0/0/1
R1(config-if)#ip nat inside 
R1(config-if)#interface s0/1/0
R1(config-if)#ip nat outside

R2(config)#access-list 2 permit 172.17.0.0 0.0.255.255
指定介面
R2(config)#ip nat inside source list 2 interface s0/1/1 overload 
介面設定NAT
R2(config)#interface g0/0/0
R2(config-if)#ip nat inside 
R2(config-if)#interface g0/0/1
R2(config-if)#ip nat inside 
R2(config-if)#interface s0/1/1
R2(config-if)#ip nat outside 
```


## 補充課程
suppl

可能考
ansible操作
terraform網頁
